<a href="https://colab.research.google.com/github/KrishnaRanjani/Machine-Learning/blob/main/Pandas/Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas**

#**Data Acquisition**

# Import the necessary libraries

In [4]:
import pandas as pd

# Import the dataset

In [7]:
data = pd.read_csv('/content/titanic.csv')

#Exploratry Data Analysis ---- Examine the data

**name** - # print the first 30 and last 30 rows

**head()**- # print the first 5 rows

**tail()** - # print the last 5 

**describe()** - # describe any numeric columns

**info()** - # concise summary

In [ ]:
data

      pclass  survived  ...   body                        home.dest
0        1.0       1.0  ...    NaN                     St Louis, MO
1        1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2        1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3        1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4        1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1305     3.0       0.0  ...    NaN                              NaN
1306     3.0       0.0  ...  304.0                              NaN
1307     3.0       0.0  ...    NaN                              NaN
1308     3.0       0.0  ...    NaN                              NaN
1309     NaN       NaN  ...    NaN                              NaN

[1310 rows x 14 columns]

In [ ]:
data.head()

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    NaN                     St Louis, MO
1     1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [ ]:
data.tail()

      pclass  survived                       name  ... boat   body  home.dest
1305     3.0       0.0      Zabour, Miss. Thamine  ...  NaN    NaN        NaN
1306     3.0       0.0  Zakarian, Mr. Mapriededer  ...  NaN  304.0        NaN
1307     3.0       0.0        Zakarian, Mr. Ortin  ...  NaN    NaN        NaN
1308     3.0       0.0         Zimmerman, Mr. Leo  ...  NaN    NaN        NaN
1309     NaN       NaN                        NaN  ...  NaN    NaN        NaN

[5 rows x 14 columns]

In [ ]:
data.describe()

            pclass     survived  ...         fare        body
count  1309.000000  1309.000000  ...  1308.000000  121.000000
mean      2.294882     0.381971  ...    33.295479  160.809917
std       0.837836     0.486055  ...    51.758668   97.696922
min       1.000000     0.000000  ...     0.000000    1.000000
25%       2.000000     0.000000  ...     7.895800   72.000000
50%       3.000000     0.000000  ...    14.454200  155.000000
75%       3.000000     1.000000  ...    31.275000  256.000000
max       3.000000     1.000000  ...   512.329200  328.000000

[8 rows x 7 columns]

In [14]:
data.describe(include = "all")

             pclass     survived  ...        body     home.dest
count   1309.000000  1309.000000  ...  121.000000           745
unique          NaN          NaN  ...         NaN           369
top             NaN          NaN  ...         NaN  New York, NY
freq            NaN          NaN  ...         NaN            64
mean       2.294882     0.381971  ...  160.809917           NaN
std        0.837836     0.486055  ...   97.696922           NaN
min        1.000000     0.000000  ...    1.000000           NaN
25%        2.000000     0.000000  ...   72.000000           NaN
50%        3.000000     0.000000  ...  155.000000           NaN
75%        3.000000     1.000000  ...  256.000000           NaN
max        3.000000     1.000000  ...  328.000000           NaN

[11 rows x 14 columns]

In [16]:
data.age.describe()

count    1046.000000
mean       29.881135
std        14.413500
min         0.166700
25%        21.000000
50%        28.000000
75%        39.000000
max        80.000000
Name: age, dtype: float64

Mean age of members

In [17]:
round(data.age.mean())

30

Age with least occurrence

In [19]:
data.age.value_counts().tail()

26.5000    1
67.0000    1
70.5000    1
76.0000    1
0.6667     1
Name: age, dtype: int64

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

# Dataset Format

*  **survival** - Survival (0 = No; 1 = Yes)
*  **class** - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
*  **name** - Name
*  **sex** - Sex
*  **age** - Age
*  **sibsp** - Number of Siblings/Spouses
*  **parch** - Number of Parents/Children Aboard
*  **ticket** - Ticket Number
*  **fare** - Passenger Fare
*  **cabin** - Cabin
*  **embarked** - Port of Embarkation
(**C** = Cherbourg; **Q** = Queenstown; **S** = Southampton)
*  **boat** - Lifeboat (if survived
*  **body** - Body number (if did not survive and body was recovered)

In [ ]:
print(data.columns)

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [21]:
data.columns[10]

'embarked'

In [22]:
data.values[18][7]

'11813'

In [ ]:
print(data.shape)

(1310, 14)

In [ ]:
data.shape[0]

1310

In [ ]:
print(data.groupby('name').size())

name
Abbing, Mr. Anthony                              1
Abbott, Master. Eugene Joseph                    1
Abbott, Mr. Rossmore Edward                      1
Abbott, Mrs. Stanton (Rosa Hunt)                 1
Abelseth, Miss. Karen Marie                      1
                                                ..
del Carlo, Mrs. Sebastiano (Argenia Genovesi)    1
van Billiard, Master. James William              1
van Billiard, Master. Walter John                1
van Billiard, Mr. Austin Blyler                  1
van Melkebeke, Mr. Philemon                      1
Length: 1307, dtype: int64

In [ ]:
data.index

RangeIndex(start=0, stop=1310, step=1)

In [ ]:
a = data.sort_values(['age'], ascending = True)
print(a)

      pclass  survived  ... body                   home.dest
763      3.0       1.0  ...  NaN  Devon, England Wichita, KS
747      3.0       0.0  ...  NaN                 Stanton, IA
1240     3.0       1.0  ...  NaN                         NaN
427      2.0       1.0  ...  NaN                 Detroit, MI
1111     3.0       0.0  ...  NaN                         NaN
...      ...       ...  ...  ...                         ...
1297     3.0       0.0  ...  NaN                         NaN
1302     3.0       0.0  ...  NaN                         NaN
1303     3.0       0.0  ...  NaN                         NaN
1305     3.0       0.0  ...  NaN                         NaN
1309     NaN       NaN  ...  NaN                         NaN

[1310 rows x 14 columns]

 # Examine the data types of the different columns

In [ ]:
data.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

# Data Type

In [ ]:
pd.Series(data.name)

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
1309                                                NaN
Name: name, Length: 1310, dtype: object

In [ ]:
pd.DataFrame(data.ticket)

      ticket
0      24160
1     113781
2     113781
3     113781
4     113781
...      ...
1305    2665
1306    2656
1307    2670
1308  315082
1309     NaN

[1310 rows x 1 columns]

# Examine and grouping the data set for survived members

In [ ]:
# Analysing survived the count of survied / unsurvied  members
b = data.groupby('survived')
b = b.sum()
print(b.pclass)

survived
0.0    2023.0
1.0     981.0
Name: pclass, dtype: float64

In [ ]:
# Specific Coloumn
print("Specific Coloumn\n")
a= data[['name','ticket']]
a

Specific Coloumn

                                                 name  ticket
0                       Allen, Miss. Elisabeth Walton   24160
1                      Allison, Master. Hudson Trevor  113781
2                        Allison, Miss. Helen Loraine  113781
3                Allison, Mr. Hudson Joshua Creighton  113781
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  113781
...                                               ...     ...
1305                            Zabour, Miss. Thamine    2665
1306                        Zakarian, Mr. Mapriededer    2656
1307                              Zakarian, Mr. Ortin    2670
1308                               Zimmerman, Mr. Leo  315082
1309                                              NaN     NaN

[1310 rows x 2 columns]

In [12]:
data.boat.nunique()

27

In [ ]:
print(data.to_string())

In [9]:
a = data.isnull().sum()
print (a)

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64